zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/same53n-pinctrl.h
/* pb14n_ccl_in9 */
#define PB14N_CCL_IN9 \
	SAM_PINMUX(b, 14, n, periph)

/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 \
	SAM_PINMUX(b, 15, a, periph)

/* pb15b_ptc_xy29 */
#define PB15B_PTC_XY29 \
	SAM_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 \
	SAM_PINMUX(b, 15, c, periph)

/* pb15e_tc5_wo1 */
#define PB15E_TC5_WO1 \
	SAM_PINMUX(b, 15, e, periph)

/* pb15f_tcc4_wo1 */
#define PB15F_TCC4_WO1 \
	SAM_PINMUX(b, 15, f, periph)

/* pb15g_tcc0_wo3 */
#define PB15G_TCC0_WO3 \
	SAM_PINMUX(b, 15, g, periph)

/* pb15k_pcc_data9 */
#define PB15K_PCC_DATA9 \
	SAM_PINMUX(b, 15, k, periph)

/* pb15l_gmac_gmdio */
#define PB15L_GMAC_GMDIO \
	SAM_PINMUX(b, 15, l, periph)

/* pb15m_gclk_io1 */
#define PB15M_GCLK_IO1 \
	SAM_PINMUX(b, 15, m, periph)

/* pb15n_ccl_in10 */
#define PB15N_CCL_IN10 \
	SAM_PINMUX(b, 15, n, periph)

/* pb16_gpio */
#define PB16_GPIO \
	SAM_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 \
	SAM_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 \
	SAM_PINMUX(b, 16, c, periph)

/* pb16e_tc6_wo0 */
#define PB16E_TC6_WO0 \
	SAM_PINMUX(b, 16, e, periph)

/* pb16f_tcc3_wo0 */
#define PB16F_TCC3_WO0 \
	SAM_PINMUX(b, 16, f, periph)

/* pb16g_tcc0_wo4 */
#define PB16G_TCC0_WO4 \
	SAM_PINMUX(b, 16, g, periph)

/* pb16i_sdhc1_cd */
#define PB16I_SDHC1_CD \
	SAM_PINMUX(b, 16, i, periph)

/* pb16j_iis_sck0 */
#define PB16J_IIS_SCK0 \
	SAM_PINMUX(b, 16, j, periph)

/* pb16m_gclk_io2 */
#define PB16M_GCLK_IO2 \
	SAM_PINMUX(b, 16, m, periph)

/* pb16n_ccl_in11 */
#define PB16N_CCL_IN11 \
	SAM_PINMUX(b, 16, n, periph)

/* pb17_gpio */
#define PB17_GPIO \
	SAM_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 \
	SAM_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 \
	SAM_PINMUX(b, 17, c, periph)

/* pb17e_tc6_wo1 */
#define PB17E_TC6_WO1 \
	SAM_PINMUX(b, 17, e, periph)

/* pb17f_tcc3_wo1 */
#define PB17F_TCC3_WO1 \
	SAM_PINMUX(b, 17, f, periph)

/* pb17g_tcc0_wo5 */
#define PB17G_TCC0_WO5 \
	SAM_PINMUX(b, 17, g, periph)

/* pb17i_sdhc1_wp */
#define PB17I_SDHC1_WP \
	SAM_PINMUX(b, 17, i, periph)

/* pb17j_iis_mck0 */
#define PB17J_IIS_MCK0 \
	SAM_PINMUX(b, 17, j, periph)

/* pb17m_gclk_io3 */
#define PB17M_GCLK_IO3 \
	SAM_PINMUX(b, 17, m, periph)

/* pb17n_ccl_out3 */
#define PB17N_CCL_OUT3 \
	SAM_PINMUX(b, 17, n, periph)

/* pb18_gpio */
#define PB18_GPIO \
	SAM_PINMUX(b, 18, gpio, gpio)

/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 \
	SAM_PINMUX(b, 18, a, periph)

/* pb18c_sercom5_pad2 */
#define PB18C_SERCOM5_PAD2 \
	SAM_PINMUX(b, 18, c, periph)

/* pb18d_sercom7_pad2 */
#define PB18D_SERCOM7_PAD2 \
	SAM_PINMUX(b, 18, d, periph)

/* pb18f_tcc1_wo0 */
#define PB18F_TCC1_WO0 \
	SAM_PINMUX(b, 18, f, periph)

/* pb18g_pdec_qdi0 */
#define PB18G_PDEC_QDI0 \
	SAM_PINMUX(b, 18, g, periph)

/* pb18i_sdhc1_dat0 */
#define PB18I_SDHC1_DAT0 \
	SAM_PINMUX(b, 18, i, periph)

/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 \
	SAM_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO \
	SAM_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 \
	SAM_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 \
	SAM_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 \
	SAM_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 \
	SAM_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 \
	SAM_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_dat1 */
#define PB19I_SDHC1_DAT1 \
	SAM_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 \
	SAM_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO \
	SAM_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 \
	SAM_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 \
	SAM_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 \
	SAM_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 \
	SAM_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 \
	SAM_PINMUX(b, 20, g, periph)

/* pb20i_sdhc1_dat2 */
#define PB20I_SDHC1_DAT2 \
	SAM_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 \
	SAM_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO \
	SAM_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 \
	SAM_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 \
	SAM_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 \
	SAM_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 \
	SAM_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_dat3 */
#define PB21I_SDHC1_DAT3 \
	SAM_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 \
	SAM_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	SAM_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 \
	SAM_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 \
	SAM_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 \
	SAM_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof */
#define PB22H_USB_SOF \
	SAM_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 \
	SAM_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 \
	SAM_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	SAM_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 \
	SAM_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 \
	SAM_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 \
	SAM_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 \
	SAM_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 \
	SAM_PINMUX(b, 23, n, periph)

